/*======================================
平成26年度 高校生ものづくりコンテスト
電子回路組立部門 東京都大会

作成日時	：7月20日
作成者		：10番 山崎晃史
所属学校	：東京都立荒川工業高等学校

ファイル名	：p05.c
課題番号	：5番
======================================*/
#include<p18f4550.h>
#include<delays.h>

#define l2 LATBbits.LATB2		//-----左の7セグメントLED
#define l3 LATBbits.LATB3		//-----右の7セグメントLED
#define l4 LATBbits.LATB4
#define l5 LATBbits.LATB5
#define l7 LATDbits.LATD7
#define D1 Delay1KTCYx(120)		//-----約0.1msの遅延
#define D10 Delay10KTCYx(120)	//-----約1msの遅延
#define TGS PORTAbits.RA3		//トグルスイッチ
#define PS PORTAbits.RA4		//フォトスイッチ
#define TS PORTAbits.RA5		//タクトスイッチ

//=====定数の宣言
char l7s[] = {					//-----7セグメントLEDの表示設定
	0b01000000,	//---0
	0b01111001,	//---1
	0b00100100,	//---2
	0b00110000,	//---3
	0b00011001,	//---4
	0b00010010,	//---5
	0b00000010,	//---6
	0b01011000,	//---7
	0b00000000,	//---8
	0b00010000,	//---9
	0b00100000,	//---a		---10
	0b00000011,	//---b		---11
	0b00100111,	//---c		---12
	0b00100001,	//---d		---13
	0b00000100,	//---e		---14
	0b00001110,	//---F		---15
	0b00101011,	//---OFF	---16
	0b01110111,	//---ON		---17
	0b01111111,	//---非表示	---18
};

//=====変数の宣言
char a,b,c,i,j;

//=====関数の宣言
void led(unsigned char a,unsigned char b);			//-----2つの7セグメントLEDを同時に表示させる関数
void ch(void);
/*======================================
	メイン関数
======================================*/
void main(void){
//=====ADコンバータをOFF
	ADCON1 |= 0x0F;
	
//=====入出力の設定
	TRISA = 0b11111000;
	TRISB = 0b00000000;
	TRISC = 0b11111000;
	TRISD = 0b00000000;
	TRISE = 0b11111000;
	
//=====ポートの初期化
	PORTA = 0;
	PORTB = 0;
	PORTC = 0;
	PORTD = 0;
	PORTE = 0;
	
//=====すべての7セグメントLEDをOFF
	l2 = 1;
	l3 = 1;
	l4 = 1;
	l5 = 1;
	
	while(1){
		if(TS == 0){
		ch();
		for(i=0;i<10;i++){
			led(i,i);
			for(j=0;j<10;j++){
			D10;
			}
			if(i==10)
			i=0;
		}
		}
	}
}
/*======================================
	自作関数
======================================*/
void led(unsigned char a,unsigned char b){		//-----2つの7セグメントLEDを同時に表示させる関数
	LATD = l7s[a];		//-----左側のLEDのデータを読み込み
	l2 = 0;				//-----左側のLEDを点灯
	D1;					//-----表示時間の確保
	l2 = 1;				//-----左側のLEDを消灯
	LATD = l7s[b];		//-----右側のLEDのデータを読み込み
	l3 = 0;				//-----右側のLEDを点灯
	D1;					//-----表示時間の確保
	l3 = 1;				//-----右側のLEDを消灯
}
void ch(void){
	char a=1,b=1;
while(1){
	if(TS==0)
	D1;
	a=0
	else if(TS==a)
	D1;
	else if(TS==b){
	D1;
	break;
	}
}
}
